cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'homebrew/completions'

brew 'stow'

# Utils
brew 'p7zip'

cask 'alfred'
cask 'cheatsheet'
cask 'appcleaner'

cask 'bartender'
cask 'bettertouchtool'

# Privacy
brew 'tor', args: ['--with-libnatpmp', '--with-libscrypt', '--with-miniupnpc']
brew 'arm'
cask 'torbrowser'

cask 'gpgtools'

cask '1password'

# Shell
cask 'iterm2-beta'
cask 'path-finder'
cask 'go2shell'

# Browsers
cask 'firefox'
cask 'google-chrome'

# Writing
brew 'commonmark'
cask 'marked'
cask 'markdown-service-tools'

cask 'grammarly'

# Reading
cask 'ridibooks'
cask 'skim'

# Backups
cask 'dropbox'
cask 'flickr-uploadr'
cask 'google-photos-backup'
cask 'gmvault'
cask 'amazon-cloud-drive'
cask 'chronosync'

# Multimedia
cask 'vlc'
cask 'air-video-server-hd'
cask 'spotify'
cask 'edgeview'
# cask 'tvmobili'

cask 'anki'
cask 'transmission'
cask 'parallels-desktop'

# Hardwares
cask 'logitech-options'
cask 'scansnap-manager-ix500'

# cask 'paragon-ntfs'
# cask 'stretchlink'
# cask 'fluid'
# cask 'duet'
# cask 'flux'
# cask 'onyx'

# See http://osxdaily.com/2012/12/05/how-to-remove-exif-data-from-images-quickly/
# cask 'imageoptim'
